Revit 2027 API
BuiltInFailures.SketchFailures.SketchingInTheWrongView Property
 Detail sketch is only editable in [View Type].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchingInTheWrongView { get; }
Public Shared ReadOnly Property SketchingInTheWrongView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchingInTheWrongView {
	FailureDefinitionId^ get ();
}
static member SketchingInTheWrongView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace